experiments/Laguna-S-2.1-FP8/serving_v100_sxm3/2026-08-09_15-31-12_1614afd1/v100x8_vllm_benchmark.txt
============ Benchmark Task ============
recipe_dir: experiments/Laguna-S-2.1-FP8/serving_v100_sxm3
variant: v100x8
gpu_name: NVIDIA Tesla V100 SXM3 32GB
gpu_count: 8
recipe:
  model:
    huggingface: poolside/Laguna-S-2.1-FP8
    task: generate
  engine:
    llm:
      context_length: 4096
      max_concurrent_requests: 1
      tensor_parallel_size: 8
      pipeline_parallel_size: 1
      data_parallel_size: 1
      gpu_memory_utilization: 0.9
      vllm:
        image: cloudriftai/1cat-vllm-sm70:1.2.2-cloudrift
        extra_args: '--revision 9e0b8ba630080b0e6f20a7b43294a9f2232fd247 --dtype half
          --attention-backend FLASH_ATTN_V100 --max-num-batched-tokens 1024 --enforce-eager
          --disable-custom-all-reduce --enable-auto-tool-choice --tool-call-parser
          poolside_v1 --reasoning-parser poolside_v1 --default-chat-template-kwargs
          ''{"enable_thinking": true}'''
        extra_env:
          VLLM_SM70_FLASH_ATTN_V100: '1'
          VLLM_SM70_FP8_TURBOMIND: '0'
          VLLM_SM70_FP8_MOE_DEQUANT_FALLBACK: '1'
          VLLM_SM70_FP8_MOE_BATCHED_GEMM: '0'
      sglang: null
      docker_options: {}
  benchmark:
    max_concurrency: 1
    num_prompts: 1
    random_input_len: 32
    random_output_len: 16
    seed: 0
    temperature: 0.0
    ignore_eos: false
    repeats: 1
  deploy:
    gpu: NVIDIA Tesla V100 SXM3 32GB
    gpu_count: 8
    driver_version: null
    cuda_version: null
  command: null
  aggregate: null
==================================================

============ Serving Benchmark Result ============
Successful requests:                     1
Failed requests:                         0
Maximum request concurrency:             1
Benchmark duration (s):                  3.03
Total input tokens:                      32
Total generated tokens:                  16
Request throughput (req/s):              0.33
Output token throughput (tok/s):         5.27
Peak output token throughput (tok/s):    7.00
Peak concurrent requests:                1.00
Total token throughput (tok/s):          15.82
---------------Time to First Token----------------
Mean TTFT (ms):                          949.39
Median TTFT (ms):                        949.39
P99 TTFT (ms):                           949.39
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          138.84
Median TPOT (ms):                        138.84
P99 TPOT (ms):                           138.84
---------------Inter-token Latency----------------
Mean ITL (ms):                           138.84
Median ITL (ms):                         140.89
P99 ITL (ms):                            143.03
==================================================

============ Docker Compose Configuration ============
services:

  vllm_0:
    image: cloudriftai/1cat-vllm-sm70:1.2.2-cloudrift
    container_name: vllm_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['0', '1', '2', '3', '4', '5', '6', '7']
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - HF_HOME=/hf_models
      - VLLM_SM70_FLASH_ATTN_V100=1
      - VLLM_SM70_FP8_TURBOMIND=0
      - VLLM_SM70_FP8_MOE_DEQUANT_FALLBACK=1
      - VLLM_SM70_FP8_MOE_BATCHED_GEMM=0
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    restart: unless-stopped
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 8
      --pipeline-parallel-size 1
      --data-parallel-size 1
      --model poolside/Laguna-S-2.1-FP8
      --served-model-name poolside/Laguna-S-2.1-FP8
      --max-model-len 4096
      --max-num-seqs 1
      --revision 9e0b8ba630080b0e6f20a7b43294a9f2232fd247 --dtype half --attention-backend FLASH_ATTN_V100 --max-num-batched-tokens 1024 --enforce-eager --disable-custom-all-reduce --enable-auto-tool-choice --tool-call-parser poolside_v1 --reasoning-parser poolside_v1 --default-chat-template-kwargs '{"enable_thinking": true}'
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 1200s
==================================================

============ Benchmark Command ============
vllm bench serve
    --model poolside/Laguna-S-2.1-FP8
    --trust-remote-code
    --max-concurrency 1
    --num-prompts 1
    --random-input-len 32
    --seed 0
    --random-output-len 16
    --temperature 0.0
    --base-url http://localhost:8000
==================================================

============ Timing ============
remote_provision           25.3s
image_pull                  6.6s
model_download              4.2s
model_load_and_warmup     147.4s
  startup                 104.6s
  weights_load             29.2s
  engine_warmup            13.5s
smoke_test                  4.0s
benchmark                  22.8s
total                     210.2s
==================================================

============ System Information ============
=== HOSTNAME ===
riftvm

=== OS ===
PRETTY_NAME="Ubuntu 24.04.1 LTS"
NAME="Ubuntu"
VERSION_ID="24.04"
VERSION="24.04.1 LTS (Noble Numbat)"
VERSION_CODENAME=noble
ID=ubuntu
ID_LIKE=debian
HOME_URL="https://www.ubuntu.com/"
SUPPORT_URL="https://help.ubuntu.com/"
BUG_REPORT_URL="https://bugs.launchpad.net/ubuntu/"
PRIVACY_POLICY_URL="https://www.ubuntu.com/legal/terms-and-policies/privacy-policy"
UBUNTU_CODENAME=noble
LOGO=ubuntu-logo

=== KERNEL ===
6.8.0-124-generic

=== CPU INFORMATION ===
Architecture:                            x86_64
CPU op-mode(s):                          32-bit, 64-bit
Address sizes:                           46 bits physical, 48 bits virtual
Byte Order:                              Little Endian
CPU(s):                                  40
On-line CPU(s) list:                     0-39
Vendor ID:                               GenuineIntel
Model name:                              Intel(R) Xeon(R) Platinum 8168 CPU @ 2.70GHz
CPU family:                              6
Model:                                   85
Thread(s) per core:                      1
Core(s) per socket:                      1
Socket(s):                               40
Stepping:                                4
BogoMIPS:                                5387.34
Flags:                                   fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 ss syscall nx pdpe1gb rdtscp lm constant_tsc arch_perfmon rep_good nopl xtopology cpuid tsc_known_freq pni pclmulqdq vmx ssse3 fma cx16 pdcm pcid sse4_1 sse4_2 x2apic movbe popcnt tsc_deadline_timer aes xsave avx f16c rdrand hypervisor lahf_lm abm 3dnowprefetch cpuid_fault pti ssbd ibrs ibpb stibp tpr_shadow flexpriority ept vpid ept_ad fsgsbase tsc_adjust bmi1 hle avx2 smep bmi2 erms invpcid rtm mpx avx512f avx512dq rdseed adx smap clflushopt clwb avx512cd avx512bw avx512vl xsaveopt xsavec xgetbv1 xsaves arat vnmi umip pku ospke md_clear flush_l1d arch_capabilities
Virtualization:                          VT-x
Hypervisor vendor:                       KVM
Virtualization type:                     full
L1d cache:                               1.3 MiB (40 instances)
L1i cache:                               1.3 MiB (40 instances)
L2 cache:                                160 MiB (40 instances)
L3 cache:                                640 MiB (40 instances)
NUMA node(s):                            1
NUMA node0 CPU(s):                       0-39
Vulnerability Gather data sampling:      Not affected
Vulnerability Indirect target selection: Mitigation; Aligned branch/return thunks
Vulnerability Itlb multihit:             Not affected
Vulnerability L1tf:                      Mitigation; PTE Inversion; VMX flush not necessary, SMT disabled
Vulnerability Mds:                       Mitigation; Clear CPU buffers; SMT Host state unknown
Vulnerability Meltdown:                  Mitigation; PTI
Vulnerability Mmio stale data:           Mitigation; Clear CPU buffers; SMT Host state unknown
Vulnerability Reg file data sampling:    Not affected
Vulnerability Retbleed:                  Mitigation; IBRS
Vulnerability Spec rstack overflow:      Not affected
Vulnerability Spec store bypass:         Mitigation; Speculative Store Bypass disabled via prctl
Vulnerability Spectre v1:                Mitigation; usercopy/swapgs barriers and __user pointer sanitization
Vulnerability Spectre v2:                Mitigation; IBRS; IBPB conditional; STIBP disabled; RSB filling; PBRSB-eIBRS Not affected; BHI SW loop, KVM SW loop
Vulnerability Srbds:                     Not affected
Vulnerability Tsa:                       Not affected
Vulnerability Tsx async abort:           Mitigation; Clear CPU buffers; SMT Host state unknown
Vulnerability Vmscape:                   Not affected

=== CPU COUNT ===
40

=== MEMORY ===
               total        used        free      shared  buff/cache   available
Mem:           668Gi        21Gi       509Gi       235Mi       143Gi       647Gi
Swap:             0B          0B          0B

=== GPU INFORMATION ===
Tesla V100-SXM3-32GB, 32768 MiB, 580.159.03, P0, 35, 0 %
Tesla V100-SXM3-32GB, 32768 MiB, 580.159.03, P0, 33, 0 %
Tesla V100-SXM3-32GB, 32768 MiB, 580.159.03, P0, 36, 0 %
Tesla V100-SXM3-32GB, 32768 MiB, 580.159.03, P0, 37, 0 %
Tesla V100-SXM3-32GB, 32768 MiB, 580.159.03, P0, 36, 0 %
Tesla V100-SXM3-32GB, 32768 MiB, 580.159.03, P0, 33, 0 %
Tesla V100-SXM3-32GB, 32768 MiB, 580.159.03, P0, 38, 0 %
Tesla V100-SXM3-32GB, 32768 MiB, 580.159.03, P0, 37, 0 %

=== GPU DETAILS ===
Sun Aug  9 22:31:46 2026
+-----------------------------------------------------------------------------------------+
| NVIDIA-SMI 580.159.03             Driver Version: 580.159.03     CUDA Version: 13.0     |
+-----------------------------------------+------------------------+----------------------+
| GPU  Name                 Persistence-M | Bus-Id          Disp.A | Volatile Uncorr. ECC |
| Fan  Temp   Perf          Pwr:Usage/Cap |           Memory-Usage | GPU-Util  Compute M. |
|                                         |                        |               MIG M. |
|=========================================+========================+======================|
|   0  Tesla V100-SXM3-32GB           Off |   00000000:01:00.0 Off |                    0 |
| N/A   35C    P0             49W /  350W |   29826MiB /  32768MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
|   1  Tesla V100-SXM3-32GB           Off |   00000000:06:00.0 Off |                    0 |
| N/A   33C    P0             47W /  350W |   29832MiB /  32768MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
|   2  Tesla V100-SXM3-32GB           Off |   00000000:07:00.0 Off |                    0 |
| N/A   36C    P0             49W /  350W |   29832MiB /  32768MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
|   3  Tesla V100-SXM3-32GB           Off |   00000000:08:00.0 Off |                    0 |
| N/A   37C    P0             49W /  350W |   29832MiB /  32768MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
|   4  Tesla V100-SXM3-32GB           Off |   00000000:09:00.0 Off |                    0 |
| N/A   36C    P0             52W /  350W |   29828MiB /  32768MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
|   5  Tesla V100-SXM3-32GB           Off |   00000000:0A:00.0 Off |                    0 |
| N/A   33C    P0             50W /  350W |   29830MiB /  32768MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
|   6  Tesla V100-SXM3-32GB           Off |   00000000:0B:00.0 Off |                    0 |
| N/A   38C    P0             49W /  350W |   29828MiB /  32768MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+
|   7  Tesla V100-SXM3-32GB           Off |   00000000:0C:00.0 Off |                    0 |
| N/A   37C    P0             51W /  350W |   29830MiB /  32768MiB |      0%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+

+-----------------------------------------------------------------------------------------+
| Processes:                                                                              |
|  GPU   GI   CI              PID   Type   Process name                        GPU Memory |
|        ID   ID                                                               Usage      |
|=========================================================================================|
|    0   N/A  N/A           88383      C   VLLM::Worker_TP0                      29822MiB |
|    1   N/A  N/A           88384      C   VLLM::Worker_TP1                      29828MiB |
|    2   N/A  N/A           88385      C   VLLM::Worker_TP2                      29828MiB |
|    3   N/A  N/A           88386      C   VLLM::Worker_TP3                      29828MiB |
|    4   N/A  N/A           88387      C   VLLM::Worker_TP4                      29824MiB |
|    5   N/A  N/A           88388      C   VLLM::Worker_TP5                      29826MiB |
|    6   N/A  N/A           88389      C   VLLM::Worker_TP6                      29824MiB |
|    7   N/A  N/A           88390      C   VLLM::Worker_TP7                      29826MiB |
+-----------------------------------------------------------------------------------------+

=== DISK USAGE ===
Filesystem      Size  Used Avail Use% Mounted on
tmpfs            67G  1.6M   67G   1% /run
efivarfs        256K   21K  231K   8% /sys/firmware/efi/efivars
/dev/vda1       3.1T  222G  2.9T   8% /
tmpfs           335G  380K  335G   1% /dev/shm
tmpfs           5.0M     0  5.0M   0% /run/lock
/dev/vda16      881M   62M  758M   8% /boot
/dev/vda15      105M  8.4M   97M   8% /boot/efi
tmpfs            67G   16K   67G   1% /run/user/1000

=== BLOCK DEVICES ===
NAME    MAJ:MIN RM  SIZE RO TYPE MOUNTPOINTS
sr0      11:0    1  368K  0 rom
vda     253:0    0  3.1T  0 disk
├─vda1  253:1    0  3.1T  0 part /
├─vda14 253:14   0    4M  0 part
├─vda15 253:15   0  106M  0 part /boot/efi
└─vda16 259:0    0  913M  0 part /boot

=== UPTIME ===
 22:31:46 up  1:41,  2 users,  load average: 2.21, 4.07, 4.86

=== DOCKER VERSION ===
Docker version 29.5.3, build d1c06ef

=== DOCKER INFO ===
29.5.3 | OS: Ubuntu 24.04.1 LTS | Containers: 2 | Images: 2
==================================================